import streamlit as st

#标题

st.title("景区数字向导")
st.header("天下第一山")
st.subheader("奇崛")

st.write("""黄山，古称黟山，坐落于安徽南部，是世界文化与自然双重遗产、世界地质公园，被誉为天下第一奇山，更有 “黄山归来不看岳” 的千古赞誉。
黄山以奇松、怪石、云海、温泉、冬雪五绝闻名天下。千峰竞秀，万壑峥嵘，莲花峰、光明顶、天都峰三大主峰巍峨耸立。迎客松挺立于危岩之上，笑迎八方来客；飞来石、猴子观海、梦笔生花等奇石鬼斧神工，移步换景；云雾翻涌时，群峰若隐若现，宛若天上仙境；朱砂古泉温润澄澈，涤荡尘劳；冬日雪霁，银装素裹，宛如琉璃世界。
这里集泰山之雄伟、华山之险峻、衡山之烟云、庐""")

st.image("Huangshan.jpg")

st.divider()

price={ "黄山风景区": ["190元", "旺季开放", "6:00-18:00"],
    "西海大峡谷": ["100元", "需另购", "7:00-17:00"],
    "太平湖景区": ["71元", "全天开放", "8:00-17:30"],
    "宏村景区": ["94元", "古村落", "7:30-17:30"],
    "西递古村": ["104元", "世界文化遗产", "8:00-18:00"],
    "翡翠谷": ["90元", "情人谷", "7:30-18:00"],
    "九龙瀑": ["80元", "瀑布景观", "8:00-17:30"],
    "齐云山": ["75元", "道教名山", "8:00-17:00"]}

st.table(price)

#密码登录
name=st.text_input("请输入姓名：")
st.write(f"你输入的姓名为：{name}")

password=st.text_input("请输入您的密码",type="password")
st.write(f"您输入的密码为：{password}")

gender=st.radio("请输入您的性别：",["男","女","不告诉你"])
st.write(f"您输入的性别是：{gender}")


